app/views/tasks/create.js.erb

INSERT INTO "tasks" ("created_at", "updated_at", "title", "deadline", "category_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2021-03-03 09:04:35.400159"], ["updated_at", "2021-03-03 09:04:35.400159"], ["title", "fae"], ["deadline", "2021-03-10 00:00:00"], ["category_id", 3]]
---
document.querySelector("#content-"+ "<%= @task.category_id %>").children[0].insertAdjacentHTML("beforeend", "<%= j render 'task', task: @task %>");