app/controllers/tasks_controller.rb

SELECT "categories".* FROM "categories"
---
  def new
    @categories = Category.all

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "tasks" ("created_at", "updated_at", "title", "deadline", "category_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2021-03-03 07:35:12.082663"], ["updated_at", "2021-03-03 07:35:12.082663"], ["title", "faire caca"], ["deadline", "2021-03-04 00:00:00"], ["category_id", 2]]
---
  def create
    @task = Task.new(task_params)
    @category = Category.find(category_params)
    @task.category = @category
    if @task.save